# SQL Statements and Operators

Corporate Customers from Maharashtra
----------

What is the query that you would write in order to find out the number of corporate customers that belong to Maharashtra?

--------

`Suggested Answer`

    select count(*)

    from cust_dimen

    where State = 'Maharashtra' and Customer_Segment = 'Corporate';

LIKE Operator
----------

Write a query to display the cities in the 'cust_dimen' table that begin with the letter 'K'.

---------

`Suggested Answer`

    select City

    from cust_dimen

    where City like 'K%';

Note that using '%K' instead would return cities having names ending with 'K'.

--------

Additional Resources:
-------

[SQL Operators](https://www.w3schools.com/sql/sql_operators.asp) is an excellent resource where you can have a quick glance at the various operators that are supported in SQL.

Pattern Matching
--------

What would be the output of the following query?

`select * from employee where first_name like "%ee%";`

---------

    It will display the details of all the employees whose name contains ‘ee’.

    ✓ Correct
    Feedback:

Correct. The % character can replace any number of preceding and trailing characters.

-----

    It will display the details of all the employees whose names both begin and end with ‘e’.

----------

    It will display the details of all the employees whose names only begin with ‘ee’.

-------

    It will display the details of all the employees whose names only end with ‘ee’.

--------

Reading the Documentation
-----------

Refer to the MySQL documentation online and answer the following question:

Which of the following wildcards are supported in SQL?

    % only

    _ (underscore) only

    * only

    Both % and _ (underscore)

--------

    Both % and _ (underscore)

    ✓ Correct
    Feedback:

Correct. % is a multi-character wildcard, whereas _ is a single-character wildcard.

For example, using "_r%" would return the words with the second character as r, followed by zero or more characters at the end.

Operators
--------

With SQL, how do you select all the records from a table named ‘employees’

where the ‘LastName’ is alphabetically between (and includes) ‘Joshi’ and ‘Sharma’?

    select * from employees where LastName > ‘Joshi’ and LastName < ‘Sharma’;

    select * from employees where LastName between ‘Joshi’ and ‘Sharma’;

    Both of the above

    None of the above

--------

    select * from employees where LastName between ‘Joshi’ and ‘Sharma’;

    ✓ Correct
    Feedback:

This query will return employees who have Joshi and Sharma as surnames, along with all the surnames that are in-between `alphabetically`.

Operators
------

Which of the queries given below would return the same output? More than one option may be correct.

---------

    select * from employees where EmpID in (2,3,4, 5);

    ✓ Correct
    Feedback:

Correct. This query will return the details of the employees with employee ids 2, 3, 4 and 5.

-----------

    select * from employees where EmpID between 2 and 5;

    ✓ Correct
    Feedback:

Correct. This query will return the details of the employees with employee ids 2, 3, 4 and 5.

----------

    select * from employees where EmpID >= 2 and EmpID <= 5;

    ✓ Correct
    Feedback:

Correct. This query will return the details of the employees with employee ids 2, 3, 4 and 5.

----------

    select * from employees where EmpID > 2 and EmpID < 5;

---------

Basic Select
-----

**Description**

Consider the following table employees containing the following columns:

**Employees**

![ss](https://media-doselect.s3.amazonaws.com/generic/OqNgkRAgJpJMpzxNJZMXNdYXR/Employee_Table.PNG)

Write a query to determine the first names of all employees.

`Execution Time Limit : 15 seconds`

------

    use upgrad;

    select firstName
    from employees;

# Aggregate Functions

Aggregate Functions
---------

Which of the following are `not` aggregate functions in MySQL?

Multiple options can be correct.

---------

    min()

---------

    mean()

    ✓ Correct
    Feedback:

Correct. avg() is the function that is used to calculate the average of a set of values.

--------

    max()

---------

    mode()

    ✓ Correct
    Feedback:

Correct. MySQL does not have built-in functions for calculating the median or mode.

-------

Count Querying
------

**Description**

Consider the employees table having the following columns.

**`Employees`**

![ss](https://media-doselect.s3.amazonaws.com/generic/E4Yb5B1yQ0QaK72GPjb2y7XNV/Employee_Table.PNG)

Write a query to retrieve the total number of employees, do the aliasing of count as totalEmployees.

------

    use upgrad;

    select count(*) as totalEmployees
    from employees;

# Ordering

Ordering Based on Multiple Columns
-------

You can order your results based on multiple columns as well.

An example of such a query would be:

    select customer_name

    from customers

    order by state, customer_name;

Here, the output (customer names) would be ordered in alphabetical order of the states.

If two or more states have the same name, then the customers would be arranged in alphabetical order of their names.

Give another example of a query where you may need to order your output based on multiple attributes of a table.

---------------

`Suggested Answer`

    select student_id

    from students

    order by state, marks;

Basic Ordering
-------

**Description**

Given an employees table with the following columns:

**`Employees`**

![ss](https://media-doselect.s3.amazonaws.com/generic/wQ0p1kzZXXGqzyKxpXZPG5ZAN/Employee_Table.PNG)

Write a query to retrieve the list of first names of employees in the alphabetical order.

----------

    use upgrad;

    select firstName
    from employees
    order by firstName;

# The Having Clause

The '`having`' clause is typically used when you have to apply a filter condition on an '`aggregated value`'.

This is because the '`where`' clause is applied `before aggregation` takes place and, thus, it is not useful when you want to apply a filter on an aggregated value.

In other words, the 'having' clause is `equivalent` to a 'where' clause after the 'group by' clause has been executed but before the 'select' clause is executed.

It is important to not get confused between the 'having' and 'where' clauses.

-------

*For example*, if you want to display the list of all the employees whose salary >= 30,000,

then you can use the 'where' clause, since there is no aggregation taking place in this query.

But if you want to display the list of all the employees whose salary <= the average salary,

where avg() is the aggregation function, then you will have to use the 'having' clause.

    select prod_id, sum(order_quantity)
    from market_fact_full
    group by prod_id
    having sum(order_quantity) > 20000
    order by sum(order_quantity) desc;

    select prod_id, sum(order_quantity)
    from market_fact_full
    group by prod_id
    order by sum(order_quantity)
    limit 3;

Keywords in SQL
----------

Arrange the keywords below in order of their occurrence in a query:

1. group by
2. order by
3. select
4. where
5. from
6. limit
7. having


    3 - 5 - 4 - 1 - 2 - 7 - 6

    3 - 5 - 1 - 4 - 2 - 6 - 7

    3 - 5 - 4 - 1 - 7 - 2 - 6

    5 - 4 - 1 - 7 - 3 - 2 - 6

------

    3 - 5 - 4 - 1 - 7 - 2 - 6

    ✓ Correct
    Feedback:

This is the correct order in which the clauses are written in a query.

- select
- from
- where
- group by
- having
- order by
- limit

# String and Date–Time Functions

String Manipulation
------

Assume that an employee named Diane Murphy has an employee number of 1002 in a dataset.

What would the output of the following set of commands?

    SELECT CONCAT(REVERSE(firstName) , '  ', UPPER(lastName))
    FROM employees
    WHERE employeeNumber=1002;

----------

    Diane MURPHY

    Enaid Murphy

    enaiD MURPHY

    enaiDMURPHY

----

    enaiD MURPHY

    ✓ Correct
    Feedback:

Correct. reverse() reverses the string and upper() converts the string to uppercase.

Math Functions
----------

- abs() – Returns the absolute value of a number
- ceil() – Returns the smallest integer value greater than or equal to the input number
- floor() – Returns the largest integer value not greater than the argument
- round() – Rounds a number to a specified number of decimal places
- rand() – Returns a random floating-point value between 0 and 1
- pow(a, b) – Returns the value a^b

Given the above math functions used in MySQL, what would the query given below return?

`select ceil(rand() * 6);`


    A random floating-point value from 0 to 6.

    A random floating-point value from 1 to 6.

    A random integer from 0 to 6.

    A random integer from 1 to 6.

---------

    A random integer from 0 to 6.

    ✓ Correct
    Feedback:

Correct. The query will return all the integers from 0 to 6 since the ceil() function is being used.

In [1]:
!pip install "SQLAlchemy<1.4"

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Requirement already satisfied: SQLAlchemy<1.4 in /usr/local/lib/python3.10/dist-packages (1.3.24)

In [2]:
%load_ext sql

In [3]:
%%sql

sqlite:///query.db

In [4]:
%%sql

select ceil(rand() * 6);

 * sqlite:///query.db
(sqlite3.OperationalError) no such function: ceil
[SQL: select ceil(rand() * 6);]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

Basic String Functions
------

**Description**

Given an employees table with the following columns:

**`Employees`**

![ss](https://media-doselect.s3.amazonaws.com/generic/wQ0p1kzZXXGqzyKxpXZPG5ZAN/Employee_Table.PNG)

Write a query to retrieve the full names of all the employees along with their employee numbers.

**`Sample Output`**

![ss](https://media-doselect.s3.amazonaws.com/generic/W8weknkbvNOVrbnPEG2EvB5ww/Capture.PNG)

--------

    use upgrad;

    select employeeNumber, concat(firstName, ' ', lastName) as fullName
    from employees;

# Regular Expressions

**Additional Resources**:

You can refer to this [MySQL | Regular expressions (Regexp) link](https://www.geeksforgeeks.org/mysql-regular-expressions-regexp/) to get an idea about some of the pattern matching that can be achieved using regular expressions.

SQL Queries
------

Which of the following keyword(s) can be used in a query to obtain the details of all the cars that have the substring toy in their brand names?

------------

    like

    ✓ Correct
    Feedback:

Correct. The query used can be:

`select * from cars where name like '%toy%';`

------------

    regexp

    ✓ Correct
    Feedback:

Correct. The query used can be:

`select * from cars where name regexp 'toy';`

---------

    substring()

-----------

    substr()

---------

Basic Regex
-----------

**Description**

Given a table named employees with the following columns:

**`Employees`**

![ss](https://media-doselect.s3.amazonaws.com/generic/QBE8NJxXpNeLo4wg5XwL4GpdG/Employee_Table.PNG)

Write a query to retrieve the employee numbers and first names of all employees having the substring **on** in their first names.

**`Sample Output`**

![ss](https://media-doselect.s3.amazonaws.com/generic/Kn53MWOOdkN9Vn0NnxwONvxMv/Capture.PNG)

----------

    use upgrad;

    select employeeNumber, firstName
    from employees
    where firstName regexp 'on';

# Nested Queries

Subqueries
----------

Which of the following statements about subqueries is true?

    They are executed after the main query is executed.

    They are executed in parallel with the main query.

    They are optionally executed after the main query,
    as and when the user requires.

    They are executed before the main query is executed.

---------------

    They are executed before the main query is executed.

    ✓ Correct
    Feedback:

Correct. The subquery always is executed `before` the execution of the main query.

The result of the `subquery is used as input` for the outer query.

Clauses Used in Subqueries
-----------

Which of the following clauses is mandatory in a subquery?

One or more than one option may be correct.

    SELECT

    WHERE

    GROUP BY

    ORDER BY

    None of the above.

----------

    SELECT

    ✓ Correct
    Feedback:

A subquery is just like any other query, which has to start with a SELECT clause.

It is contained within an outer query.

Subqueries
----------

**Description**

Given a table named customers with the following columns:

![ss](https://media-doselect.s3.amazonaws.com/generic/P4ZVwM0eLjNo3RJEGQRAeNaZ8/Customers.PNG)

Write a query to retrieve the names of all customers who have a credit limit greater than what `La Rochelle Gifts` has.

------

    use upgrad;

    select customerName
    from customers
    where creditLimit >
      (
        select creditLimit
        from customers
        where customerName = 'La Rochelle Gifts'
      )
    order by creditLimit;

## Common Table Expression (CTE)

CTEs
-----

If you need to reference the same data set multiple times, then a CTE is not the choice.

    True

    False

-------

    False

    ✓ Correct
    Feedback:

Correct. A CTE is used mostly for referencing the same table to get a subset of the values that it contains.

CTEs vs Derived Tables
---------

A derived table is basically a subquery, except it is always in the FROM clause of an SQL statement.

Given this information, is the following statement true or false?

`Common Table Expressions is another name for derived tables.`

    True

    False

--------

    False

    ✓ Correct
    Feedback:

Common Table Expressions are different in the sense that they are created using the ‘with’ clause,

as opposed to a derived table, which is a part of the ‘select’ statement.

# Summary

- Relational, arithmetic and logical operators
- Aggregate functions
- Regular expressions
- Nested queries
- Common Table Expressions
- Views
- Advantages of views over CTEs